{
  "_meta": {
    "NoteForTranslators1": "Please be careful to exactly preserve all formatting tags (like <b>...</b>) and special characters (like \r\n).",
    "NoteForTranslators2": "A mistake in the exact spelling of any of these will always break the formatting and cause text errors.",
    "NoteForTranslators3": "If possible, it would be good to test the game before submitting, and check that all text displays correctly.",
    "NoteForTranslators4": "Tags / special characters used:",
    "NoteForTranslators5": "<b> ... </b> : bold",
    "NoteForTranslators6": "<color=#xxxxxxxx> ... </color> : change color",
    "NoteForTranslators7": "<size=xx> ... </size> : change size",
    "NoteForTranslators8": "\r\n : new line (backslash, not forward slash)",
    "NoteForTranslators9": "Thank you!",
    "NoteForTranslators10": "Entries beginning with 'TTS' are for Text To Speech. These have all formatting tags and special characters removed."
  },
  "en": {
    "Title":"<color=#FFFFFFFF>MAL</color>FUNCTION",
	"StartButton":"Start",
	"Game_Submit":"Submit",
	"Game_EnterAns":"Enter Ans",
	"Game_InputToSolve":"Input to solve",
	"Button_Submit":"SUBMIT",
    "Input_Placeholder": "Enter output...",
    "Input_Label": "INPUT",
    "Function_Label": "FUNCTION",
    "Output_Label": "OUTPUT",
	"Buy_Rocket":"ROCKET TOWER",
	"Buy_Nuke":"NUKE TOWER",
	"Buy_Shield":"SHIELD TOWER",
    "Tutorial_1":"Asteroids are incoming and Earth is in danger! We need to design a rocket defense system.\r\n\r\nHowever, in order to intercept the asteroids, we need to calculate the trajectory of the rockets.",
    "Tutorial_2":"This is a <b>Cartesian Grid</b>.",
    "Tutorial_3":"The Cartesian Grid breaks up space into numerical coordinates.\r\n\r\nPoints on this grid can be represented by two values: <b>x</b> (horizontal position) and <b>y</b> (vertical position), which together are the point’s coordinates.\r\n\r\nA point’s coordinates are written in this form: <b>(x,y)</b>",
    "Tutorial_4":"The <b>rocket</b> is currently located at <b>(3,9)</b> on the Cartesian Grid, because it is at the intercept of 3 on the x-axis (seen on bottom) and 9 on the y-axis (seen on left).",
    "Tutorial_5":"The <b>rocket tower</b>, which shot the rocket, is located at <b>(0,0)</b>.",
    "Tutorial_6":"Enter the coordinates of the incoming <b>asteroid</b> into the provided x and y fields, and press SUBMIT.",
    "Tutorial_7":"Correct!\r\n\r\nThe incoming <b>asteroid</b> is located at <b>(5,10)</b>.",
	"Tutorial_7_Wrong":"Incorrect. Try again.\r\n\r\nFollow the line down from the asteroid to the x-axis, and to the left from the asteroid to the y-axis. Then input the x and y values below.",
    "Tutorial_8":"It seems that our rocket is off course and following the wrong trajectory.\r\n\r\nThe trajectory (path) that a rocket will follow can be represented by a <b>function</b>.",
    "Tutorial_9":"A function applies a <b>rule</b> to an <b>input</b> in order to produce an <b>output</b>.",
    "Tutorial_10":"For example, the <b>function</b> that represents the rocket’s path is <b>y = 3x</b>.\r\n\r\nBy inserting the <b>input</b> of <b>x = 3</b>, we get an <b>output</b> of <b>y = 9</b>.\r\n\r\nWe get this result by substituting the x in the equation with its value of 3. So y = 3x = 3 × (3) = 9.",
    "Tutorial_11":"<b>function:</b>  y = 3x\r\n<b>rule:</b>  3x\r\n<b>input:</b>  x = 3\r\n<b>output:</b>  y = 9",
    "Tutorial_12":"By using the function <b>y = 3x</b>, and plugging in the following input x-values, we can solve for the corresponding output y-values.\r\n\r\ninput     function    output\r\n  0        y = 3×0       0\r\n  1         y = 3×1        3\r\n  2        y = 3×2        6\r\n  3        y = 3×3        9",
	"Tutorial_13":"Our goal is to hit the asteroid with the rocket, and so we can see that the current function is wrong, since the rocket’s path never intercepts the asteroid.\r\n\r\nThe asteroid’s x-position is <b>5</b>. If we plug that value into the rocket trajectory function <b>y = 3x</b>, we get <b>y = 3 × (5) = 15</b>.\r\n\r\nHowever, the asteroid’s y-position is actually <b>10</b>, not 15.",
  	"Tutorial_14":"The actual function rule is <b>y = 2x</b>. Using this function rule and the input of <b>x = 5</b>, solve for the output below.",
	"Tutorial_14_Wrong":"Incorrect. Try again.\r\n\r\nTry substituting x with 5, so <b>y = 2x</b> becomes <b>y = 2 × (5)</b>. Enter the value of y below.",
	"Tutorial_15":"Correct!\r\n\r\nThe function <b>y = 2x</b> with the input of <b>x = 5</b> becomes <b>y = 2 × (5) = 15</b>.",
	"Tutorial_16":"By understanding functions, we can understand how to aim and build defenses.\r\n\r\nCorrectly solving functions with a given input, by entering the corresponding output, will earn <b>Science points</b>, shown in the top right corner.",
	"Tutorial_17":"By solving functions, our new defenses can automatically use them to aim at incoming asteroids.",
	"Tutorial_18":"Science points can can be used to purchase <b>rocket towers</b>, <b>nuke towers</b>, and <b>shield towers</b>. (Shield towers are more useful once you have a few rocket towers.)\r\n\r\nThe button for each of these displays the corresponding price in Science points.",
	"Tutorial_19":"Functions will get harder over time.\r\n\r\nHarder functions are worth more Science points than easier functions.\r\n\r\nBut don’t forget that if you get a question wrong, then you will lose Science points.",
	"Tutorial_20":"Some of the harder functions will even have multiple input values. For example:\r\n\r\n<b>rule:</b>  3x + 5y + 2\r\n<b>input:</b>  (x,y) = (2,3)\r\n\r\nSo the output would be <b>y = 3×2 + 5×3 + 2 = 23</b>.",
	"Tutorial_21":"Are you ready?\r\n\r\nSolve functions as fast as you can in order to purchase as many defenses as you can, as quickly as possible!\r\n\r\nDon’t worry about aiming the rockets and nukes. They will auto-aim, protecting you scientists and engineers long enough to solve more functions.\r\n\r\nBut they won’t last long, so you need to keep on solving quickly to buy more!",
    "Tutorial_22": "The asteroid bombardment will end in 8 minutes. You must survive till then.\r\n\r\nA new wave will hit every 90 seconds, and the waves will get increasingly intense over time.\r\n\r\nGood luck. \r\n\r\nTake a deep breath... \r\n\r\nGet ready to begin.",
    "Tutorial_NextButton": "Next",
    "Victory": "Victory! You survived the asteroid waves.",
	"GameOverText":"Time survived\r\nWaves survived\r\nSuccess rate\r\nCorrect answers\r\nIncorrect answers",
    "PlayAgainButton": "Play again",
    "ExitGameButton":  "Exit game",
	"RestartGame": "RESTART"
	 },

  "jp": {
    
	 },
	 "ru": {
    
	 },
	 "zh": {
    
	 },
	 "es": {
    
	 }	 
}
