{
  "_meta": {
    "NoteForTranslators1": "Please be careful to exactly preserve all formatting tags (like <b>...</b>) and special characters (like \r\n).",
    "NoteForTranslators2": "A mistake in the exact spelling of any of these will always break the formatting and cause text errors.",
    "NoteForTranslators3": "If possible, it would be good to test the game before submitting, and check that all text displays correctly.",
    "NoteForTranslators4": "Tags / special characters used:",
    "NoteForTranslators5": "<b> ... </b> : bold",
    "NoteForTranslators6": "<color=#xxxxxxxx> ... </color> : change color",
    "NoteForTranslators7": "<size=xx> ... </size> : change size",
    "NoteForTranslators8": "\r\n : new line (backslash, not forward slash)",
    "NoteForTranslators9": "Thank you!",
    "NoteForTranslators10": "Entries beginning with 'TTS' are for Text To Speech. These have all formatting tags and special characters removed."
  },
  "en": {
    "Title":"<color=#FFFFFFFF>MAL</color>FUNCTION",
	"StartButton":"Start",
	"Game_Submit":"Submit",
	"Game_EnterAns":"Enter Ans",
	"Game_InputToSolve":"Input to solve",
	"Button_Submit":"SUBMIT",
    "Input_Placeholder": "Enter output...",
    "Input_Label": "INPUT",
    "Function_Label": "FUNCTION",
    "Output_Label": "OUTPUT",
	"Buy_Rocket":"ROCKET TOWER",
	"Buy_Nuke":"NUKE TOWER",
	"Buy_Shield":"SHIELD TOWER",
    "Tutorial_1":"The earth has entered the asteroid belt! You must save the earth from destruction by waves of incoming asteroids!\r\n\r\nUse your strategy and mathematical skills to defend your buildings from the explosive impacts of the deadly asteroids.\r\n\r\nIf all of your buildings are destroyed, you lose! The waves will increase in intensity over time, so stay alive for as long as you can.",
    "Tutorial_2":"In order to defend against the asteroids, you can buy rocket towers, nuke towers, and shield towers. You need to spend Science points to buy these buildings, and each has a specific price in Science points, displayed beside the corresponding button.\r\n\r\nYou can earn Science points by correctly answering function questions. You will see how to do this soon.",
    "Tutorial_3":"You begin the game with a set of houses, which are the most basic kind of building. You cannot buy these, and they cannot do anything to counteract the asteroids.",
    "Tutorial_4":"Buying rocket towers and nuke towers will allow you to shoot the asteroids out of the sky before they reach your buildings. Once you buy any of these, they will operate automatically, so you don't have to worry about aiming and shooting them yourself.\r\n\r\nBuying shield towers will give you extra protection on the ground in case any asteroids escape your rockets and nukes.\r\n\r\nWhen you buy a tower, it will be placed in an empty space, if possible. Otherwise, it will replace a building of lesser value.",
    "Tutorial_5":"A function is a rule for transforming inputs into outputs. If you put a particular input value into a function, you will always get no more than one single output value. In this game we will work only with linear functions. Linear functions will always produce exactly one output for every input.\r\n\r\nThe rule for a given function is specified by an operation or set of operations applied to the input.",
    "Tutorial_6":"For example, consider a function called ‘f’ that is defined by the following rule: f(x) = 5x + 1. If the input is x = 2, then the output will be 11, which you can calculate by substituting the value of x into the function rule: (5 × 2) + 1 = 11.",
    "Tutorial_7":"We can represent a linear function with one input (x) by graphing it as a line in a two-dimensional coordinate plane, where the x dimension represents input values, and the y dimension represents output values.\r\n\r\nA single point on the line is identified by a coordinate pair, (x, y), where the value of x is a particular possible input, and the value of y is the single output produced by applying the function to that input.",
    "Tutorial_8":"Recall the function f defined by the rule f(x) = 5x + 1. When we represent this function with a graph, the input of x = 2 will be transformed into the output of y = 11. Therefore, we will be able to find the point (2, 11) inside of the line representing the function.",
    "Tutorial_9":"In order to earn Science points and buy towers, you need to correctly answer function questions. There are two types of function questions: function rule questions, and function graph questions.\r\n\r\nFor each function rule question, you are given a function rule and the input values for the function. Given this information, you must find the output.\r\n\r\nFor each function graph question, you are given a function graph and the input value for the function. Given this information, you must find the output.",
    "Tutorial_10":"As you answer more questions, the difficulty will increase. Eventually, you will move from function rule questions with 1 input variable (x) to those with 2 input variables (x, y) and 3 input variables (x, y, z).\r\n\r\nMulti-variable linear functions work in the same way as single-variable linear functions. For example, if the function is f(x, y, z) = 2x + 3y − 4z, and the input is (x, y, z) = (4, 2, 1), then the output will be 10, which you can calculate by substituting the values of x, y, and z into the function rule: (2 × 4) + (3 × 2) − (4 × 1) = 8 + 6 − 4 = 10.",
    "Tutorial_11":"Correct answers will earn you science points. But be careful: incorrect answers will cost you science points!",
    "Tutorial_12":"The game is about to begin. See how many waves you can survive! Good luck!",
	"Tutorial_NextButton":"Next",
	"GameOverText":"Time survived\r\nWaves survived\r\nSuccess rate\r\nCorrect answers\r\nIncorrect answers",
    "PlayAgainButton": "Play again",
    "ExitGameButton":  "Exit game",
	"RestartGame": "RESTART"
	 },

  "jp": {
    
	 },
	 "ru": {
    
	 },
	 "zh": {
    
	 },
	 "es": {
    
	 }	 
}
